<template>
  <div>
    <div class="notice">
      <h3 class="title in-padding">风险提示书</h3>
      <p class="text in-padding"><span class="blod">尊敬的出借人(小鸽理财平台上投资人)：</span>
        <br>
        <br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;出借有风险，当您（贵司）出借时，可能获得利息，但同时也面临着风险。<span class="blod">您（贵司）在做出接受网络借贷信息中介机构服务和出借决策之前，请仔细阅读本风险提示书，全面认识网络借贷的风险和特性，认真考虑本服务存在的各项风险因素，并充分考虑自身的投资风险意识、风险识别能力和风险承受能力，谨慎做出接受服务和出借的决策。当您在小鸽理财平台上的网站等相关页面上点击“确认”、“完成”或 “同意”等类似提示按钮，或者实际使用小鸽理财平台提供的服务（以下简称“服务”），或者与小鸽理财平台签订其他相关服务协议时，请您事先仔细阅读本提示书的内容，您在点击“确认”、“同意”或实际使用服务，或者签订相关服务协议即代表您完全知悉本提示书的全部内容。 </span>
        <br>
        <br>根据有关法律法规，网络借贷信息中介机构和出借人做出如下承诺、风险提示及声明：
        <br><span class="blod">一、风险提示</span>
        <br>（一）主要风险
        <br>网络借贷信息中介机构将按照依法、诚信、自愿、公平的原则为出借人和借款人提供信息中介服务，维护出借人与借款人的合法权益。但网络借贷信息中介机构不提供增信服务，不承担借贷违约风险。出借人和借款人遵循借贷自愿、诚实守信、责任自负、风险自担的原则承担借贷风险，出借人自行承担借贷产品的本息损失。
        <br>2、借款人风险
        <br>借款人因经验及能力不足风险、婚姻及家庭不稳定风险、居住不稳定风险、品质及道德风险、健康风险、信用风险、经营风险、股权风险、管理不足风险、还款能力不足风险、过度负债风险等原因，未按照合同约定还款，导致出借人的出借本金和利息无法按时回收。
        <br>3、出借人风险
        <br>出借人因其出借风险意识、风险识别能力、出借经历、风险承受能力等原因，未能准确了解借贷风险，出借决策产生偏差，致使自身遭受损失。
        <br>4、资金回收风险
        <br>针对出借人出借本金或者回款再出借资金，网络借贷信息中介机构会积极协助出借人寻找、推荐借款人，以完成资金出借、获取利息之目的，但寻找、推荐借款人日期存在一定不确定性，会导致出借人在出借期限届满后可能无法完全回收出借资金和获得利息。
        <br>5、促成失败的风险
        <br>本次借款的促成需符合相关法律法规的规定和借款合同的约定，可能存在不能满足成立条件从而无法成立的风险。
        <br>6、市场风险
        <br>网络借贷行业因受经济因素、政治因素等各种因素影响而引起的波动，从而会产生风险。
        <br>
        <br>（二）一般风险
        <br>1、税收风险
        <br>对于本借款所适用的税务政策，中国财政机关和税务机关尚未制定统一、完善的税务法律体系，且由于各地方政府税务机关存在执行不统一、稳定性差、缺乏足够的政策支持等特点，出借人的利息收入可能会因相应的税收政策的变化而受到不利影响。
        <br>2、经济周期风险
        <br>经济运行具有周期性的特点，全球宏观经济运行状况将对出借人获得期待利息产生影响，从而产生风险。
        <br>3、管理风险
        <br>网络借贷信息中介机构的知识、经验、判断、决策、技能等，会影响其对信息的搜集、信息交互和对借款人的资信评估，将会影响出借人的利息收入，从而产生风险。
        <br>4、经营风险
        <br>网络借贷信息中介机构承诺将按照相关法律法规的规定进行运营及管理，但无法保证永久符合相关法律和监管部门的要求。如网络借贷信息中介机构无法继续经营网络借贷信息中介业务或发生重大业务调整，或财产状况发生重大变化，则可能会对出借人产生不利影响。
        <br>网络借贷信息中介机构有权将借款人信息复核、贷后跟踪等用户服务事项以委托服务/服务外包等方式交由其他机构办理，因合作机构不符合监管部门规定的资质，或被监管部门撤销相关业务许可、责令停业整顿等原因不能正常履行职责，或不具备提供服务的相关条件、或因管理不善，或发生停业、解散、破产、被吊销营业执照等情形，可能会给出借人带来一定的风险。
        <br>5、操作或技术风险
        <br>操作或技术风险是指网络借贷信息中介机构、支付机构或资金存管机构在业务操作过程中，因内部控制存在缺陷或者人为因素造成操作失误或违反操作规程等引致的风险，例如交易错误、IT系统故障等风险。
        <br>6、法律和政策风险
        <br>法律法规的变化，货币政策、财政政策、行业政策的调整，以及监管部门对金融市场和网贷行业监管政策的调整，均可能影响本次借款的资金成本和履约表现，从而产生本息损失的风险。
        <br>7、其他风险
        <br>战争、自然灾害等不可抗力的出现，可能导致借贷本息遭受损失。代理机构违约等超出网络借贷信息中介机构自身直接控制能力范围之外的风险，也可能导致出借人的利益受损，从而带来风险。
        <br>
        <br><span class="blod">二、其他提示</span>
        <br>请出借人仔细阅读相关合同的全部内容，了解并知悉根据合同规定而享有的权利及应当承担的义务和风险。
        <br>
        <br><span class="blod">在您（贵司）确认注册及出借前，应当仔细阅读本风险提示书、并独立作出是否接受服务和出借的决定。您（贵司）注册后则视为本提示书是您（贵司）真实的意思表示，您（贵司）已知悉并理解本服务的全部风险，并自愿承担由此带来的一切后果。</span>
        <br>&nbsp;
      </p>
      <h3 class="footer in-padding">风险告知方（网络借贷信息中介机构）：{{company}}</h3>
    </div>
  </div>
</template>
<script>
export default {
  data() {
    return {
      company: "深圳市温馨港湾网络技术有限公司",
      id: ["1", "2", "3", "4", "5", "6", "7", "8", "9"],
      text: [
        "深圳市千文贸易有限公司",
        "深圳市壹佳置业有限公司",
        "福建省致云融资租赁有限公司",
        "深圳市鸿明源有限公司",
        "深圳市大牛窝装饰有限公司",
        "深圳市申易实业有限公司",
        "小鸽理财",
        "敦化江南村镇银行股份有限公司",
        "包头青山河套村镇银行股份有限公司"
      ]
    };
  },
  methods: {
    changeCompany: function() {
      var companyId = this.$route.query.companyId;
      if (companyId != 0 || companyId != undefined) {
        for (var i = 0; i < this.id.length; i++) {
          if (this.id[i] == companyId) {
            this.company = this.text[i];
          }
        }
      } else {
      }
    }
  },
  mounted() {
    document.body.scrollTop = 0;
    document.documentElement.scrollTop = 0;
    this.changeCompany();
  }
};
</script>
<style>
@import "../../../style/css/mobile_risk_warning.css";
</style>
