<template>
  <div>
    <div class="agree" v-if="isoldborrow == 0">
      <img src="/static/img/ban.png" class="ban-img">
      <div class="main-box">
        <p>协议编号：
          <span>{{protocolNumber}}</span>
        </p>
        <br>
        <p>小鸽理财借款协议（以下简称“本协议”）由以下各方于
          <span>{{auditTimeversion2}}</span>签署（为了保护出借人与借款人的信息，本协议在小鸽理财平台展示时部分隐藏出借人与借款人的个人基本信息，本协议对出借人与借款人基本信息的部分隐藏不影响本协议的效力）。
        </p>
        <p
          class="blod"
        >为了维护您的自身权益、防范风险，请在签署本协议前仔细阅读本协议各条款以及与本服务相关的全部服务规则，特别是加粗字体条款，以充分知悉、了解小鸽理财平台借贷中介服务的运作规则、资金出借范围以及各方的权利、义务。您一旦签署本协议即视为对本协议全部条款及相关业务规则的充分理解并完全接受。</p>
        <table class="tab-color tab-no">
          <thead>
            <tr>
              <th style="border-radius: 4px;">甲方（出借人）：以“小鸽理财”平台上最终确认的出借人为准</th>
            </tr>
          </thead>
        </table>
        <table class="tab-color">
          <thead>
            <tr>
              <th>乙方（借款人）：</th>
            </tr>
          </thead>
          <tbody v-show="borrowWay==1">
            <tr>
              <td>小鸽理财用户名：
                <span>{{username}}</span>
              </td>
            </tr>
            <tr>
              <td>真实姓名：
                <span>{{realname}}</span>
              </td>
            </tr>
            <tr>
              <td>公民身份号码：
                <span>{{idno}}</span>
              </td>
            </tr>
          </tbody>
          <tbody v-show="borrowWay==2">
            <tr>
              <td>小鸽理财用户名：
                <span>{{username}}</span>
              </td>
            </tr>
            <tr>
              <td>企业名称：
                <span>{{enterpriseName}}</span>
              </td>
            </tr>
            <tr>
              <td>统一社会信用代码：
                <span>{{companyNo}}</span>
              </td>
            </tr>
            <tr>
              <td>法人姓名：
                <span>{{legal}}</span>
              </td>
            </tr>
            <tr>
              <td>法人身份证号码：
                <span>{{legalidCardNo}}</span>
              </td>
            </tr>
          </tbody>
        </table>
        <table class="tab-color">
          <thead>
            <tr>
              <th>丙方（担保方）：
                <span>{{guarantee}}</span>
              </th>
            </tr>
          </thead>
          <tbody>
            <tr>
              <td>地址：
                <span>{{guaranteeAddress}}</span>
              </td>
            </tr>
          </tbody>
        </table>
        <div class="relative">
          <table class="tab-color">
            <thead>
              <tr>
                <th>丁方（服务方）：深圳市温馨港湾网络技术有限公司</th>
              </tr>
            </thead>
            <tbody>
              <tr>
                <td>地址：深圳市南山区粤海街道粤兴五道9号北理工创新大厦1202</td>
              </tr>
            </tbody>
          </table>
          <div class="clear"></div>
        </div>
        <h2>定义：</h2>
        <p>除非上下文另有解释，下列用语具在本协议中定义如下：
          <br>
        </p>
        <p>
          <span class="p-span"></span>1、出借人（甲方）：指通过丁方小鸽理财网成功注册账户的会员，可参考丁方的推荐、自主选择出借一定数量资金给借款人，且具有完全民事权利及行为能力的自然人。
          <br>
          <span class="p-span"></span>2、借款人（乙方）：指有一定的资金需求，经过丙方信用评估后筛选推荐、在丁方小鸽理财网注册账户，由丁方推荐给出借人并得到出借人资金，且具有完全民事权利及行为能力的自然人。
          <br>
          <span class="p-span"></span>3、担保方（丙方）：系在广东省深圳市合法成立并有效存续的有限责任公司，可就乙方提供的信息对乙方的还款能力、还款意愿和资产状况进行评估、分析，出具借款审核意见，同时对乙方的借款承担逾期代偿责任的法人组织。
          <br>
          <span class="p-span"></span>4、服务方（丁方）：系在广东省深圳市合法成立并有效存续的有限责任公司，符合网络借贷信息中介机构法律、法规及其他规范性文件要求，依法拥有开展网络借贷信息中介业务资质的企业法人，系“小鸽理财网”权利主体。
          <br>
          <span class="p-span"></span>5、小额借款：出借人拟向借款人提供的在网络借贷法律规范限定数额标准内的借款。
          <br>
          <span class="p-span"></span>6、小鸽理财网：指丁方运营管理的“小鸽理财”网站（域名为：www.xiaogelicai.com）、“小鸽理财”注册微信服务号（微信号为：xiaogelicai）、 “小鸽理财”APP 软件，并为各主体在小鸽理财网站上达成的交易提供信息搜集、 信息公布、资信评估、信息交互、借贷撮合服务的信息中介平台。
          <br>
          <span class="p-span"></span>7、小鸽理财网账户：指出借人或借款人以自身名义在小鸽理财网注册后系统自动生成的虚拟账户，可以通过第三方支付机构及/或其他通道进行充值或提现。
          <br>
          <span class="p-span"></span>8、存管账户：以甲方、乙方名义在资金监管银行开立的、账户内资金由其自行支配且银行实施监管的虚拟账户。
          <br>
          <span class="p-span"></span>9、借款人资金存管账户：指借款人在小鸽理财平台合作的存管银行开立的用于本项目项下各项支付结算的银行存管账户。
          <br>
          <span class="p-span"></span>10、出借人资金存管账户：指出借人在小鸽理财平台合作的存管银行开立的用于本项目项下各项支付结算的银行存管账户。
          <br>
          <br>
          <span class="p-span"></span>就乙方通过由丁方运营管理的小鸽理财网平台向甲方申请借款、并由丙方承担逾期代偿责任等事宜，各方根据平等、自愿的原则，达成如下协议：
        </p>
        <h2>一、借款金额及期限</h2>
        <p>
          <span class="p-span"></span>乙方同意通过小鸽理财网平台向甲方申请借款，甲方同意通过小鸽理财网向乙方发放该借款，具体借款信息如下：
          <br>
        </p>
        <table class="tab-box">
          <tr>
            <td>借款用途</td>
            <td>
              <span>{{detail}}</span>
            </td>
          </tr>
          <tr>
            <td>借款本金数额</td>
            <td>
              <span>{{borrowAmount}}元</span>
            </td>
          </tr>
          <tr>
            <td>借款年利率</td>
            <td>
              <span>{{annualRate}}%</span>
            </td>
          </tr>
          <tr>
            <td>还款方式</td>
            <td>
              <span>{{paymentModeStr}}</span>
            </td>
          </tr>
          <tr>
            <td>每期还本息或息数额</td>
            <td>
              <span>{{sumPI}}元</span>
            </td>
          </tr>
          <tr>
            <td>最后一期应还本息数额</td>
            <td>
              <span>{{lastAmount}}元</span>
            </td>
          </tr>
          <tr>
            <td>还款期数</td>
            <td>
              <span>{{qsNumber}}期</span>
            </td>
          </tr>
          <tr>
            <td>还款日（借款人适用）</td>
            <td>
              <span>暂定为每月{{repayDay}}日(以实际还款日为准)</span>
            </td>
          </tr>
          <tr>
            <td>回款日（出款人使用）</td>
            <td>
              <span>暂定为每月{{repayDay}}日(以实际还款日为准)</span>
            </td>
          </tr>
          <tr>
            <td>借款期限</td>
            <td>
              <span>{{auditTime1}}至{{endtimwe1}}（放款日至到期日）</span>
            </td>
          </tr>
        </table>
        <p class="p2">注意：以上借款信息中的每期还本息或息数额，还款采用到期一次性还本付息方式，则表示每期还息数额；还款采用按月付息到期还本或等额本息方式，则表示每期还本息数额。</p>
        <h2>二、借款流程</h2>
        <p class="p2">
          <span class="p-span"></span>2.1 本协议成立：甲方同意并确认小鸽理财网的规则和说明，通过在小鸽理财网上对乙方发布的借款需求点击“立即投资”确认的方式签署本协议，本协议自签署之日起生效。 乙方的借款投标与甲方的投资信息匹配时即系双方达成借款合意，双方有意形成借款法律关系，该合意系双方真实意思表示，双方自愿履行。
          <br>
          <span class="p-span"></span>2.2 募集期：原则上募集期为产品上线之时始，至募集资金完毕之时止，固定期限为7 至 20 日。产品自募集期结束后开始正式运作，甲方可在募集期内购买任意产品。募集期内，甲方已成功支付资金的，视为甲乙双方已建立借贷关系。
          <br>
          <span class="p-span"></span>2.3 出借资金划转：募集期结束后，乙方即不可撤销地授权丁方委托相应的第三方支付机构或资金监管银行，将金额等同于本协议第一条所列的“借款本金数额”的资金，由甲方存管账户中划转至乙方存管账户或者乙方指定的存管账户中，划转完毕即视为借款发放成功，借款利息及相关费用自借款发放成功后开始计算。
          <br>
          <span class="p-span"></span>2.4 本协议生效：产品募集期届满，且本协议项下出借资金已经划付至乙方存管账户或乙方指定的存管账户中后，本协议生效。
          <br>
        </p>
        <h2>三、收费及税费</h2>
        <p class="p2">
          <span class="p-span"></span>3.1 丙方有权就为本协议借款所提供的服务向乙方收取手续费和服务费等费用，上述费用的收取方式由乙、丙双方另行约定。
          <br>
          <span class="p-span"></span>3.2 丁方有权就为本协议借款所提供的服务向乙方收取综合服务费等费用，费用的收取由乙、丁双方另行约定。
          <br>
        </p>
        <h2>四、 还款方式</h2>
        <p class="p2">
          <span class="p-span"></span>4.1 乙方必须按照本协议的约定按时、足额偿还应支付借款本金和利息。
          <br>
          <span class="p-span"></span>4.2 甲方在丁方平台开立的存管账户为收取乙方的还款本金和利息的指定账户，各方同意乙方应当支付的本息一经划转至甲方所指定的存管账户后，即视为乙方已经履行本协议项下对甲方的相应还款义务。
          <br>
          <span class="p-span"></span>4.3 如果还款日遇到法定假日或公休日，还款日期自动顺延至节假日/公休日后的第一个工作日。
          <br>
          <span class="p-span"></span>4.4 如果还款日为每月30 日或31 日，则遇到无还款日对应日的月份，还款日为应还款当月的最后一日；如遇应还款当月最后一日为法定节假日或公休日的，按本协议4.3的方式处理。
          <br>
          <span class="p-span"></span>4.5 本协议如涉及借款人系两人以上，任一借款人均应履行本协议项下的义务，对全部借款承担连带清偿责任，甲方有权向乙方任一借款人追索本金、利息、逾期罚息及其他费用（包括但不限于因追索债权或催收产生的诉讼费、保全费、诉讼产出保全保险费、律师费、差旅费等费用）。
          <br>
          <span class="p-span"></span>4.6 乙方每期还款按照如下顺序清偿： （1）根据本协议产生的其他全部费用（包括但不限于追索债权而支出的律师费、诉讼费、仲裁费或其他与本协议相关的费用支出）；（2）违约金/补偿金；（3）逾期罚息；（4）拖欠利息；（5）拖欠本金；（6）当期利息；（7）当期本金。
          <br>
          <span class="p-span"></span>4.7 如乙方还款不足以偿还借款本金、利息和逾期罚息的，甲方同意各自按照其借出款项比例收取还款，不足的部分由丙方进行代偿。
          <br>
        </p>
        <h2>五、代偿服务</h2>
        <p class="p2 blod">
          <span class="p-span2"></span>5.1 丙方同意为本协议下甲、乙双方的债权债务提供连带责任保证。丙方为乙方承担保证责任之前的，可要求乙方进行反担保，反担保既可以系乙方以外的第三人担保，也可以系乙方提供相应财产设定担保物权。如在约定还款日乙方未按时还款，丙方应在约定还款日次日立即向甲方所指定的收款账户转入等同于乙方当期应还的借款本息的金额，自丙方成功支付乙方当期应还的借款本息至甲方指定的收款账户内即视为丙方承担了担保责任，自丙方承担代偿责任后，当期债权对应金额的债权转让给丙方，乙方应就该笔债务向丙方承担清偿责任。
          <br>
          <span class="p-span2"></span>5.2 丙方根据上述规定承担代偿责任后，甲方在本协议项下的当期的所有权利视为已经得到满足和实现，甲方不得再对乙方提出任何请求或主张。甲方在本协议下所享的关于当期债权的全部权利和主张，包括但不限于对借款本息等所享有权利和主张，均由丙方享有。
          <br>
          <span class="p-span2"></span>5.3 丙方的承担担保责任的期限为：自本协议项下借款发放之日起至借款到期后2年止。经乙方申请，甲方在本协议项下之债权后续进行展期的，则担保期间自展期的借款期限届满后起算。
          <br>
          <span class="p-span2"></span>5.4 丙方的担保范围包括：乙方的借款本金、利息、罚息、违约金/补偿金、赔偿金（若有）、实现债权的费用(包括但不限于催收费用、律师费、诉讼费或仲裁费、诉讼财产保全保险费、公证费用、执行费用等一切费用)以及丁方的服务费用、其他到期应付的款项等。
          <br>
          <span class="p-span2"></span>5.5 甲方委托丁方作为其合法代理人，在本协议项下协助上述担保代偿事宜的办理，包括但不限于向丙方出具《履行担保责任告知函》、丙方承担担保责任后出具《债权权益转移确认书》、向债务人发送《债权转让通知书》（或由丙方自行发送）等，以保证甲方借款资金安全。
          <br>
          <span class="p-span2"></span>5.6 本协议项下之甲方债权向第三方进行转让的，则丙方应当继续就转让后的债权承担担保责任，不得以其未同意为由拒绝履行担保义务。
          <br>
          <span class="p-span2"></span>5.7甲乙丙丁各方授权并同意丙方履行代偿责任后，由甲方授权丁方向丙方出具《履行担保[增加第5.7条款]责任告知函》、丙方承担担保责任后出具《债权权益转移确认书》、向债务人发送《债权转让通知书》、代为出具相应书面授权文件，由丁方协助丙方开展诉讼/仲裁等各项催收工作。丙方通过法律手段向乙方追偿产生的费用（诉讼费或仲裁费、保全费、诉讼财产保全保险费、律师费、差旅费、评估费、公证费、执行费等合理的、必要的费用）均由乙方承担。
          <br>
        </p>
        <h2>六、 提前还款</h2>
        <p class="p2">
          <span class="p-span"></span>6.1 乙方提出提前偿还全部剩余本金时，甲方授权丙方决定是否同意乙方提出的提前还款申请。丙方同意乙方提前还款申请的，应当书面通知丁方。
          <br>
          <span class="p-span"></span>6.2 还款采用到期一次性还本付息方式的，乙方应向甲方一次性支付全部借款本金及实际借款日期利息。
          <br>
          <span class="p-span"></span>6.3 还款采用按月付息到期还本方式的，乙方应向甲方一次性支付全部借款本金及当期利息。
          <br>
          <span class="p-span"></span>6.4 还款采用等额本息方式的，乙方应向甲方一次性支付剩余本金及当期利息。
          <br>
          <span class="p-span"></span>6.5 提前还款的款项划转方式与约定正常还款的方式相同，全部款项划转完毕后，丁方通过短信、电话、电子邮件或者小鸽理财网站内信等方式将提前还款事宜向甲方进行提示与说明，自乙方全部借款本息清偿之日起丙方保证责任终止。
          <br>
          <span class="p-span"></span>6.6 如乙方未能按照本协议约定按时、足额偿还任何一期借款本息超过【30】天，或者根据丙方认定发生任何可能影响乙方偿付能力的情形，各方同意丙方有权代甲方提出提前清偿全部剩余本金的要求。
          <br>
          <span class="p-span"></span>6.7 甲方、乙方及丁方应同意该等要求，且乙方应当按上述6.1 在收到丙方提前还款通知之日起三个工作日内向甲方支付剩余全部本金、当期利息。
          <br>
          <span class="p-span"></span>6.8 如乙方未能支付上述款项则丙方需在收到丁方通知后一个工作日内履行代偿责任，自代偿之日起，甲方、丁方在本协议下所享的剩余债权的全部权利和主张，包括但不限于对借款剩余本息、逾期罚息、综合服务费等所享有权利和主张，均全部转让给丙方。
          <br>
          <span class="p-span"></span>6.9 乙方提出提前偿还部分本金的，则乙方提前还款部分由丁方监管账户代为保管，不提前抵扣乙方剩余本息及费用，在下一期还款时从中抵扣应还款项。
          <br>
        </p>
        <h2>七、逾期还款</h2>
        <p class="p2">
          <span class="p-span"></span>7.1 如在约定还款日23:00前，丁方监管账户中未收到或未足额收到乙方当月应还款的，视为逾期还款。
          <br>
          <span class="p-span"></span>7.2 如乙方逾期还款且丙方未及时履行代偿责任的，对于到期一次性还本付息还款方式，乙方应按照初始借款本金，自逾期日按【
          <span>{{penaltyInterest}}</span>%】/日的利率按日向甲方支付逾期罚息，直至清偿完毕之日止，逾期罚息不计复利。对于按月付息到期还本还款方式，乙方应按照初始借款本金，自逾期之日按【
          <span>{{penaltyInterest}}</span>%】/日的利率按日向甲方支付逾期罚息，直至清偿完毕之日止，逾期罚息不计复利。 对于等额本息还款方式，乙方应按照当期应还本息，自逾期之日按【
          <span>{{penaltyInterest}}</span>%】/日的利率按日向甲方支付逾期罚息，直至清偿完毕之日止，逾期罚息不计复利。
          <br>
          <span class="p-span"></span>7.3 如乙方未在每月还款日足额支付当月应还借款本息，但丙方及时履行代偿责任，从而并未造成甲方未按时收到当月应得本息还款的，则由此导致的逾期责任（包括但不限于催收费、 代偿费等）由乙方及丙方另行约定， 若无约定的可按7.2的标准执行。
          <br>
          <span class="p-span"></span>7.4 逾期款项中的利息不计利息。
          <br>
          <span class="p-span"></span>7.5 借款期间内，逾期罚息的计收标准可根据小鸽理财网相关规则的变化进行相应调整。如相关规则发生变化，则小鸽理财网会在网站公示该等规则的变化。
          <br>
        </p>
        <h2>八、关于展期的约定</h2>
        <p class="p2">
          <span class="p-span"></span>8.1 本协议借款期限届满之前，乙方可申请展期。
          <br>
          <span class="p-span"></span>8.2 甲乙方确认，乙方满足下列条件时，可进行展期：
          <br>
          <span class="p-span2"></span>（1）乙方以书面形式向甲方申请借款展期，展期已经获得甲方书面同意（详见《展期确认函》）；
          <br>
          <span class="p-span2"></span>（2）乙方已偿还不低于10%的借款本金；
          <br>
          <span class="p-span"></span>（3）乙方已付清展期期间的借款利息（具体以最终确认的利息金额为准）、服务费以及其他乙方所应支付的全部费用；
          <br>
          <span class="p-span2"></span>（4）乙方已付清展期时原借款期限下所应承担的已经产生的借款利息、服务费以及其他乙方所应支付的全部费用。
          <br>
          <span class="p-span"></span>8.3 展期期间借款利率、还款方式不作调整，展期后的还款计划以新《还款计划表》为准。
          <br>
          <span class="p-span"></span>8.4 展期期间，甲方可申请转让债权，且不收取转让费用。
          <br>
          <span class="p-span"></span>8.5 展期结束后，乙方应及时归还欠款，并支付全部应付款项。若乙方未能及时还款，则适用本协议第五条规定，由丙方代偿。
          <br>
          <span class="p-span"></span>8.6 乙方连续申请展期次数不得超过2次，如超过2次以上的展期申请，丁方不予受理。
          <br>
        </p>
        <h2>九、违约责任</h2>
        <p class="p2">
          <span class="p-span"></span>9.1 如果乙方擅自改变本协议约定的借款用途、严重违反本协议义务、提供虚假资料、故意隐瞒重要事实或未经甲方、丙方同意擅自转让本协议项下借款债务的视为乙方恶意违约，甲方、丙方有权提前终止本协议；乙方须在甲方委托丙方或丁方提出终止本协议之日起3 日内，按照本协议第五条规定的款项划转方式一次性支付余下的所有本金、利息，丁方再根据其与甲方之间的约定向甲方支付该等资金；如乙方未按约定时间支付上述款项的，则由丙方履行代偿义务。如乙方违约构成犯罪的，甲方、丙方及丁方有权向相关国家机关举报，依法追究其刑事责任。
          <br>
          <span class="p-span"></span>9.2 发生下列任何一项或几项情形的，视为乙方严重违约：
          <br>
          <span class="p-span"></span>（1）乙方的任何财产遭受没收、征用、查封、扣押、冻结等可能影响其履约能力的不利事件，且不能及时提供有效补救措施的；
          <br>
          <span class="p-span"></span>（2） 乙方的财务状况出现影响其履约能力的不利变化，且不能及时提供有效补救措施的。
          <br>
          <span class="p-span"></span>9.3 若发生9.2 款所述情形，或根据甲方、丙方合理判断乙方可能发生上述的违约事件的， 甲方、丙方有权自行或由丙方委托丁方采取下列任何一项或几项救济措施：
          <br>
          <span class="p-span"></span>（1）立即暂缓、取消发放全部或部分借款；
          <br>
          <span class="p-span"></span>（2） 宣布已发放借款全部提前到期，乙方应立即偿还所有应付款；
          <br>
          <span class="p-span"></span>（3）提前终止本协议；
          <br>
          <span class="p-span"></span>（4） 采取法律、法规以及本协议约定的其他救济措施。
          <br>采取上述措施后，丙方在原代偿范围内继续承担本协议项下的代偿责任。
          <br>
          <span class="p-span"></span>9.4 甲方、丙方根据本协议9.1 及9.3 的规定自行或由丙方委托丁方终止本协议的，如乙方在其小鸽理财账户下有任何余额，则乙方余额按照本协议第5.7 款进行清偿。
          <br>
          <span class="p-span"></span>9.5 甲方保留将乙方违约失信的相关信息纳入公民征信系统、向媒体和乙方单位披露的权利。因乙方未还款而带来的调查及包括但不限于诉讼费、保全费、律师费等合理、必要费用由乙方承担。
          <br>
          <span class="p-span"></span>9.6 因出现上述违约情况而提前终止本协议的，若乙方未按照约定时间向甲方一次性支付余下的所有本金、利息和相关违约金，则丙方须按本协议第七条的约定履行代偿责任，代替乙方向甲方一次性支付余下的所有本金、利息和相关违约金，丙方在履行代偿责任后，有权向乙方追偿并收取相应的款项，收取方式由乙丙双方另行约定。
          <br>
        </p>
        <h2>十、通知与送达</h2>
        <p class="p2">
          <span class="p-span"></span>
          <span
            class="blod"
          >10.1 各方在此确认，本协议签订之日至借款全部清偿之日期间，除本协议另有约定外，本协议项下各方发出的各项通知，均需以书面形式（挂号信、特快专递、电子邮件、手机短信、微信）发出；甲方、乙方在此同意并确认，其在本协议项下提供及/或在小鸽理财平台预留的电话号码、电子邮箱、住址为其有效的联系方式和送达地址，丙方、丁方对甲方、乙方的各项通知，以及各方按本协议约定解决争议的过程中的法律文书及其他涉诉材料，除本协议另有约定外，可以以向其在小鸽理财平台的账户、其提供的电子邮箱和手机号码发送信息的方式发送，还可以拨打其预留的电话号上述通知的发送，在如下日期视为送达：专人送达：通知方向被通知方送达所示日；挂号信邮递：发出通知方持有的国内挂号函件收据所示日后第5日；特快专递：发出通知方持有的发送凭证上邮戳日起第4日；录音电话：通知方通知之时；小鸽理财平台账户站内信：发件人系统显示已成功发送之日；电子邮件：发出通知方邮件系统显示发送成功之时；手机短信：发出通知方系统显示发送成功之时。微信即时通讯：发送成功之时。</span>
          <br>
          <span class="p-span"></span>10.2 若乙方向丁方提供的有关小额借款的任何信息（包括但不限于乙方姓名、身份证号码、住址、电子邮件等信息的变更）发生变更，则乙方应在发生变更之日起的三日内通过小鸽理财网提供更新后的信息给甲方，并提交相应的证明文件。
          <br>
          <span class="p-span"></span>10.3 若因乙方未及时提供上述变更信息而导致的甲方、丙方及/或丁方的调查及诉讼费、律师费等费用应由乙方承担。
          <br>
        </p>
        <h2>十一、债权转让</h2>
        <p class="p2">
          <span class="p-span"></span>11.1 各方同意并确认，甲方可将本协议项下全部借款的债权转让予第三方。
          <br>
          <span class="p-span"></span>11.2 甲方根据本协议转让借款债权时，债权受让人依法承接甲方在本协议项下的权利和义务。债权转让后，乙方需对债权受让人在剩余借款期限继续履行本协议下其对甲方的还款义务，丙方在原保证担保的范围内继续承担本协议项下的逾期债权代偿责任。
          <br>
        </p>
        <h2>十二、甲方特别授权</h2>
        <p class="p2 blod">
          <span class="p-span"></span>12.1 甲方知悉丁方已在丁方合作的存管银行开立交易结算资金存管账户体系，甲方不可撤销地授权丁方将其姓名、身份证件号码、银行账号等相关信息提供给存管银行，由存管银行在存管账户项下为甲方开立出借人存管账户，为甲方提供资金管理服务。
          <br>
          <span class="p-span"></span>12.2 甲方知悉在甲方签署本协议后即授权丁方或其合作方以甲方的名义向第三方认证机构申请用户数字证书，该用户数字证书由第三方认证机构保存。当甲方发起签章指令、甲方授权丁方或丁方合作的第三方代为发起签章指令后，第三方认证机构即在相关协议或文件上使用甲方数字证书签章。甲方是否申请数字证书以生效协议中显示为准。
          <br>
          <span class="p-span"></span>12.3 授权匹配：甲方在签署本协议时不可撤销地授权丁方根据小鸽理财平台有关规则通过系统对借款项目进行匹配、转让及受让。
          <br>
          <span class="p-span"></span>12.4 授权转让债权：甲方在签署本协议时不可撤销地授权丁方根据小鸽理财平台有关规则在转让债权时以及根据法律法规的要求或平台基于合理的商业考虑认为对甲方有利时对甲方持有的债权通过低频、逐笔的方式进行转让。该等债权最终转让完毕的时间以其实际交易情况确定，丁方并不对该等债权转让完成的时间做出任何承诺和保证。丙方履行担保责任后由丁方代为出具权益转让资料协助丙方开展诉讼/仲裁等催收措施。
          <br>
          <span class="p-span"></span>12.5 授权签署协议：甲方不可撤销地授权丁方调用甲方的电子签名签署相关协议(包括但不限于《小鸽理财借款协议》《债权转让协议》《债权转让通知书》《债权权益转移确认书》等)。甲方对此等借款项目的匹配、转让、受让和协议签署之安排已充分知悉并理解，该等签署的协议均视为甲方真实意思表示，甲方对该等法律文件的效力均予以认可且无任何异议并无条件接受以该上述方式签署的借款协议、债权转让及受让协议之约束，丁方即可根据该等协议和本协议相关约定，根据甲方授权协助存管银行对相关款项进行划扣、支付、冻结以及行使其他权利，甲方对此均予以接受和认可。
          <br>
          <span class="p-span"></span>12.6 如乙方未履行偿还借款本息义务及丙方未履行担保清偿责任，甲方授权丁方(包括通过丁方合作机构)以自身名义通过各种手段（包括但不限于电话通知、上门通知、发律师函、对乙方提起诉讼、仲裁、执行及保全等）行使催收权利。如丙方履行担保责任后，该项权利由丙方行使。
          <br>
          <span class="p-span"></span>12.7 甲方同意并授权丁方及其合作的第三方支付机构或存管银行按照本协议及小鸽理财平台相关规则的约定对资金及相关费用进行划扣及代收付。
          <br>
        </p>
        <h2>十三、风险提示</h2>
        <p class="p2 blod">
          各方在”小鸽理财”进行出借投资过程中，可能会面临诸多风险因素，包括但不限于借款方/债权转让方违约风险、第三方担保、政策风险、逾期风险、信息传递风险、网络安全风险、不可抗力风险。请评估自身风险承受能力、财务状况及投资理财经验，自行决定是否对”小鸽理财”发布项目进行出借（投资）。鉴于风险因素存在多样性和不确定性，请独立判断、谨慎出借（投资）。
          <br>
          <span class="p-span"></span>13.1 来自于借款方的风险
          <br>请理解并确认，借款人可能违约，因其自身状况导致借款方无法按时、足额支付借款本息，并且该违约将可能导致出借（投资）的本息无法得到偿还。
          <br>
          <span class="p-span"></span>13.2 来自于担保方的风险
          <br>“小鸽理财”上发布的借款信息所产生的债权债务关系若采用第三方担保公司担保或借款人自行提供的保证人或其他方式保障投资人的资金安全，但”小鸽理财”不保证出借（投资）的本息均能得到偿还。如借款方逾期还款，第三方担保机构支付不能、进入破产程序、依法被吊销营业执照、依法被撤销或遭遇行业限制、担保物灭失及因其他因素导致无法实现资金本息保障的，则出借的本息将可能无法得到偿还。
          <br>
          <span class="p-span"></span>13.3 来自于网络、技术、管制等方面的风险
          <br>鉴于网络金融的特殊性，因技术故障、支付故障（银行、第三方支付机构、网关运营商、电信运营商服务技术障碍）、网络数据传输故障、网络安全、有权机关管制或限制等因素或其他不可抗力因素有可能导致出借（投资）的本息延迟或损失。
          <br>
          <span class="p-span"></span>13.4 法律、法规、政策风险
          <br>出借人有可能面临因国家法律、法规、规章、政策的出台或重大变化而遭受本金及收益损失。
          <br>
          <span class="p-span"></span>13.5 征信体系不完善的风险
          <br>借款人提出借款（融资）申请后，”小鸽理财”会对借款人申请的拟发布借款（融资）信息进行审核，但由于目前国内信用征信体系尚不完善，”小鸽理财”不能完全保证发布信息的真实性、有效性、完整性，网站提供的信息资料仅供参考，最终是否进行出借（投资），请综合考虑自身投资经验、风险承受能力、相关法律法规和规章、金融知识及对网络金融现状的了解，进行独立判断，作出出借（投资）决策并自行承担由此产生的风险。
          <br>
          <span class="p-span"></span>13.6 网络借贷中介服务平台的角色
          <br>“小鸽理财”仅为平台各方的借贷/债权转让、担保、资金安全保障提供中介服务。”小鸽理财”自身不提供任何担保，”小鸽理财”在出借人（投资人）与借款人之间、债权转让方和受让方之间的债权债务关系中不担任任何担保人或者保证人的角色。
          <br>
          <span class="p-span"></span>13.7 出借人承诺及保证
          <br>出借人在”小鸽理财”进行交易过程中，请保证：
          <span class="p-span"></span>（1）出借人的出借（投资）资金来源合法且有权进行出借（投资）处分；
          <br>
          <span class="p-span"></span>（2）未使用非法资金进行出借（投资）或在网络借贷中介服务平台洗钱；
          <br>
          <span class="p-span"></span>（3）未使用非自有资金（包括但不限于银行贷款、从他人处筹措的资金、占有的他人所有但无处分权的资金等）进行出借（投资）；
          <br>
          <span class="p-span"></span>（4）与借款方串通进行虚假的借款（融资）和出借（投资）、债权转让和受让。
          <br>否则，因此所引发的任何纠纷均由出借人自行负责解决并承担相应责任。
          <br>
          <span class="p-span"></span>13.8 借款承诺及保证
          <br>借款人在“小鸽理财”平台进行交易过程中，请承诺及保证：
          <br>（1）借款用途真实有效。
          <br>（2）不以任何理由将借款资金挪作他用。
          <br>（3）借款资金不用于购买股票、基金和理财产品，不以任何形式流入证券、期货等资本市场和股本权益性投资及其他非法用途，不将借款资金划入股票、期货账户。
          <br>（4）乙方应按丙方和丁方的要求提供相关资料，保证其提供的信息、资料均为合法、真实、有效，不存在任何虚假、遗漏和隐瞒，否则乙方应承担相应的法律后果和责任。
          <br>（5）乙方应接受并配合丙方和丁方对其借款资金使用情况和其财务状况进行监督检查。
          <br>（6）乙方应按本协议约定按时足额偿还借款本息，并按本协议及相关协议、规则的约定向丙方及丁方支付相应的借款管理费、居间服务费等。
          <br>（7）乙方应承担借款过程中涉及的转账手续费、评估、公证/见证、抵押/质押登记、保险及其他相关的费用。
          <br>（8）乙方承诺并保证已提供在所有网络借贷信息中介机构未偿还借款信息，且借款人作为自然人在不同网络借贷信息中介机构平台借款总余额(含本次借款)未超过人民币100万元；如借款人为法人或其他组织，则在不同网络借贷信息中介机构平台借款总余额(含本次借款)不超过人民币500万元。
          <br>（9）在出借人转让本协议项下的债权后，借款人需对债权受让方（新债权人）继续履行本协议下其对出借人的所有义务，不得以未接到债权转让通知为由拒绝履行还款义务。
          <br>
        </p>
        <h2>十四、其他</h2>
        <p class="p2">
          <span class="p-span"></span>14.1 本协议以电子文本形式生成。本协议自甲方勾选“《小鸽理财借款协议》”(具体名称以小鸽理财平台显示为准)之日起签署并生效，至乙方将本协议下全部本金、利息、逾期罚息、违约金/补偿金及其他相关费用全部偿还完毕及服务方、担保方全部义务履行完毕之日自动终止。除另有约定外，非经双方协商一致不得单方解除。
          <br>
          <span class="p-span"></span>14.2 本协议的任何修改、补充均须以小鸽理财网平台电子文本形式作出。本协议及其修改或补充均采用通过小鸽理财平台以点击操作形成电子文本形式制成，可以有一份或者多份并且每一份具有同等法律效力，并保存在丁方为此设立的专用服务器（含丁方委托的专业第三方存证机构的存储服务器）上备查和保管。各方均认可该形式的协议效力。
          <br>
          <span class="p-span"></span>14.3 各方均确认，本协议的签订、生效和履行以不违反网络借贷信息中介机构相关金融监管法律、法规、地方性法规及规范性法律文件为前提。如果本协议中的任何一条或多条违反适用的法律，则该条将被视为无效，但该无效条款并不影响本协议其他条款的效力。
          <br>
          <span class="p-span"></span>14.4 如果各方在本协议履行过程中发生任何争议，应友好协商解决；如协商不成，则须提交本协议签署地人民法院进行诉讼，各方同意本协议签署地为深圳市南山区。
          <br>
          <span class="p-span"></span>14.5 乙方承诺，其在“小鸽理财”平台申请的借款累计借款余额未超过相关网络借贷信息中介法律法规的规定，亦不存在禁止借款的情形，资信良好，如因乙方违反该承诺给协议相关方造成损失的，责任由乙方承担。
          <br>
          <span class="p-span"></span>14.6 乙方同意并授权丁方有权对其进行信用调查，包括但不限于向征信机构查询信用信息。丁方有权合法使用乙方提供的所有资料及征信资料，除可将该资料用于评估乙方借款资格外，并可将该资料用于信息披露、与政府监管部门、征信机构、债权受让人、丁方合作的第三方公司以及债权转让平台等数据共享。
          <br>
          <span class="p-span"></span>以下无正文
          <br>
        </p>
        <br>
        <br>
        <p class="p2">甲方（出借人）：
          <span>
            <span class="group-seal"></span>
          </span>
        </p>
        <br>
        <br>
        <br>
        <p class="p2">乙方（借款人）：
          <span>
            {{realname}}
            <img v-show="borrowWay==2" class="seal-img" :src="borrowImage">
            <img v-show="borrowWay==1" class="seal-p" :src="borrowImage">
          </span>
        </p>
        <br>
        <br>
        <br>
        <p class="p2">丙方（担保方）：
          <span>
            {{guarantee}}
            <img
              class="seal-img"
              :src="guaranteeImage"
              v-if="guaranteeImage != 'data:image/png;base64,'"
            >
          </span>
        </p>
        <br>
        <br>
        <br>
        <p class="p2">
          丁方（服务方）：深圳市温馨港湾网络技术有限公司
          <span class="seal"></span>
        </p>
        <br>
        <br>
        <p class="p2">
          <span>签署日期：【{{curYear}}】年【{{curMonth}}】月【{{curDay}}】日</span>
        </p>
        <p class="p2">
          <span>签署地点：【&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;】市【&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;】区</span>
        </p>
        <p>附：出借人表</p>
        <table class="tab-box">
          <thead>
            <tr>
              <th colspan="4" style="text-align: center">甲方（出借人）</th>
            </tr>
          </thead>
          <tbody>
            <tr>
              <td>小鸽理财用户名</td>
              <td>真实姓名</td>
              <td>借款本金（单位：元）</td>
              <td>总计应收本息（单位：元）</td>
            </tr>
            <tr v-for="jia in jias" :key="jia.id">
              <td v-for="val in jia" :key="val.id">
                <span>{{val}}</span>
              </td>
            </tr>
          </tbody>
        </table>
      </div>
      <br>
      <br>
    </div>
    <div class="old-agree" v-else>
      <img src="/static/img/ban.png" class="ban-img">
      <div class="main-box">
        <p>本小鸽理财借款协议（“本协议”）由以下各方于【
          <span>{{auditTimeversion2}}</span>】在中国广东省深圳市南山区签订：
        </p>
        <table class="tab-color tab-no">
          <thead>
            <tr>
              <th colspan="6">甲方：（出借人）</th>
            </tr>
          </thead>
          <tbody style="text-align:center" id="jia">
            <tr>
              <td>用户名（昵称）</td>
              <td>借出金额
                <br>(单位：元)
              </td>
              <td>借款期限
                <br>(天|月)
              </td>
              <td>总计应收本息
                <br>(单位：元)
              </td>
            </tr>
            <tr v-for="jia in jias" :key="jia.id" v-show="oldShow === true">
              <td v-for="val in jia" :key="val.id">
                <span>{{val}}</span>
              </td>
            </tr>
            <tr class="up-icon" @click="oldShow = !oldShow">
              <td colspan="6">查看</td>
            </tr>
          </tbody>
        </table>
        <table class="tab-color">
          <thead>
            <tr>
              <th>乙方（借款人）</th>
            </tr>
          </thead>
          <tbody>
            <tr>
              <td>真实姓名：
                <span id="yirealname">{{realname}}</span>
              </td>
            </tr>
            <tr>
              <td>公民身份号码：
                <span id="yiidno">{{idno}}</span>
              </td>
            </tr>
          </tbody>
        </table>
        <table class="tab-color">
          <thead>
            <tr>
              <th>丙方（风控方）：深圳市快鸽互联网金融服务有限公司</th>
            </tr>
          </thead>
          <tbody>
            <tr>
              <td>住所地: 深圳市南山区高新九道北理工创新大厦13楼</td>
            </tr>
          </tbody>
        </table>
        <div class="relative">
          <table class="tab-color">
            <thead>
              <tr>
                <th>丁方（服务方）：深圳市温馨港湾网络技术有限公司</th>
              </tr>
            </thead>
            <tbody>
              <tr>
                <td>地址：深圳市南山区高新九道北理工创新大厦12楼</td>
              </tr>
            </tbody>
          </table>
          <div class="clear"></div>
          <div class="seal"></div>
        </div>
        <h2>定义：</h2>
        <p>除非上下文另有解释，下列用于具有以下含义：
          <br>
          <br>
        </p>
        <p>
          <span class="p-span"></span>1、出借人：指通过小鸽理财网成功注册账户的具有完全民事权利能力与民事行为能力的自然人、法人或者非法人组织会员，承诺对本协议涉及的借款具有完全的支配能力，是其自有闲散资金，为其合法所得并承诺提供给丁方的信息是完全真实、准确、完整的主体；亦即甲方。
          <br>
          <span class="p-span"></span>2、借款人：指通过小鸽理财网注册的拥有完全民事行为能力的自然人客户；有短期、小额资金需求，资信良好，符合借款人条件并承诺向丁方提供真实、准确、完整借款所需信息及咨讯的主体；亦即乙方。
          <br>
          <span class="p-span"></span>3、风控方：系在深圳市合法成立并有效存续的有限责任公司，负责协助丁方对乙方在小鸽理财平台上的借款申请进行调查核实（包括但不限于身份审核、资信评估、财产信息等），接受乙方的委托协助乙方完成其在小鸽理财平台上借款信息的发布和从事乙方还款资金管理（根据乙方授权）等活动的法人组织；亦即丙方。
          <br>
          <span class="p-span"></span>4、服务方：系在深圳市合法成立并有效存续的有限责任公司，拥有“小鸽理财”网站（域名为：www.xiaogelicai.com）、“小鸽理财”注册微信服务号（微信号为：xiaogelicai）、“小鸽理财”APP软件的经营权，并为各主体在小鸽理财网站上达成的交易提供信息搜集、信息公布、资信评估、信息交互、借贷撮合服务的信息中介平台；亦即丁方。
          <br>
          <span class="p-span"></span>5、小鸽理财网账户：指出借人或借款人以自身名义在小鸽理财网注册后系统自动生成的虚拟账户，可以通过第三方支付机构及/或其他通道进行充值或提现。
          <br>
          <span class="p-span"></span>6、监管虚拟账户：以甲方、乙方名义在资金监管银行开立的、账户内资金由其自行支配且银行实施监管的虚拟账户。
          <br>
          <span class="p-span"></span>7、借款基本信息：借款人在小鸽理财平台发布的借款金额、借款利率、借款期限、借款用途等不可撤销的借款邀约。
          <br>
          <span class="p-span"></span>8、还款日：自实际借款日至次月相对应日。（如：借款日为10日，则每月还款日亦为10日；若当月没有该日，则还款日为当月最后一日）。
          <br>
          <span class="p-span"></span>9、日：本协议中如无特别说明，“日”系指自然日。
          <br>
          <br>
          <span class="p-span"></span>就乙方通过由丁方运营管理的小鸽理财网平台向甲方借款、并由丙方承担逾期代偿责任等事宜，各方根据平等、自愿的原则，达成如下协议。且本协议构成乙方与丙方签署的相关借款协议、以及丙方与丁方签署的编号为【
          <span id="agreementnumber">{{agreementNumber}}</span>】 的《互联网金融项目合作协议》（协议具体名称在实际签订时有所调整，但不影响本条对该合作协议的锁定关系）不可分割的组成部分。
        </p>
        <h2>一、借款基本信息</h2>
        <p>乙方同意通过小鸽理财网平台向甲方借款，甲方同意通过小鸽理财网向乙方发放该借款，具体借款信息如下：
          <br>
          <br>
        </p>
        <table class="tab-box">
          <tr>
            <td style="width:140px;">借款用途
              <br>&nbsp;
            </td>
            <td>
              <span id="detail">{{detail}}</span>
            </td>
          </tr>
          <tr>
            <td>借款年利率</td>
            <td>
              <span id="annualrate">{{annualRate}}%</span>
            </td>
          </tr>
          <tr>
            <td>借款本金数额</td>
            <td>
              <span id="borrowamount">{{borrowAmount}}</span>
            </td>
          </tr>
          <tr>
            <td>期|月 还本息
              <br>数额
            </td>
            <td>
              <span id="lastmonthpay2">{{lastMonthpay}}</span>
            </td>
          </tr>
          <tr>
            <td>第[
              <span id="month">{{month}}</span>]期应偿还本息
              <br>数额
            </td>
            <td>
              <span id="lastmonthpay">{{lastMonthpay}}</span>
            </td>
          </tr>
          <tr>
            <td>还款期数</td>
            <td>
              <span id="deadline">{{deadline}}</span>
            </td>
          </tr>
          <tr>
            <td>还款日</td>
            <td>
              <span id="sb1">{{sb1}}</span>
            </td>
          </tr>
          <tr>
            <td>还款起止日期</td>
            <td>
              <span id="sb2">{{sb2}}</span>
            </td>
          </tr>
        </table>
        <h2>二、借款流程</h2>
        <p class="p2">
          <span class="p-span"></span>2.1 本协议成立：甲方同意并确认小鸽理财网的规则和说明，通过在小鸽理财网上对乙方发布的借款需求点击“立即投资”确认的方式签署本协议，本协议自签署之日起生效。乙方的借款投标与甲方的投资信息匹配时即系双方达成借款合意，双方有意达成借款关系。
          <br>
          <span class="p-span"></span>2.2 募集期：原则上募集期为产品上线之时始，至募集资金完毕之时止，固定期限为7至20日。产品自募集期结束后开始正式运作，甲方可在募集期内购买任意产品。募集期内，甲方已成功支付资金的，仅视为甲乙双方已建立借贷关系，有且仅在募集期结束后，甲方方可转让该债权。
          <br>
          <span class="p-span"></span>2.3 出借资金交付：募集期结束后，乙方即不可撤销地授权丁方委托相应的第三方支付机构或资金监管银行，将本协议第一条所列的“借款本金数额”等额的资金，由甲方监管虚拟账户中划转至乙方监管虚拟账户或者乙方指定的监管虚拟账户中，划转完毕即视为借款交付成功，借款利息及相关费用开始计算。
          <br>
        </p>
        <h2>三、各方的权利与义务</h2>
        <p class="p2">
          <span class="p-span"></span>3.1 甲方的权利与义务
          <br>
          <span class="p-span2"></span>3.1.1 甲方保证其所用于出借的资金来源合法，甲方是该资金的合法所有人，如第三方对资金归属、合法性问题提出异议，则由甲方自行解决。如甲方未能解决，则放弃享有其所出借资金所带来的利息收益，若由于甲方资金权属纠纷导致本协议下任何第三方的损失的，由甲方负责赔偿；若甲方已构成违约的，应承担违约责任。
          <br>
          <span class="p-span2"></span>3.1.2 甲方享有其所出借款项所带来的利息收益，并自行承担并缴付该等利息收益应当缴付之税费。
          <br>
          <span class="p-span2"></span>3.1.3 甲方同意对本协议项下对乙方的债权转让。在甲方的债权转让后，乙方仍应按照本协议约定支付向债权受让人支付每期应支付借款本息，不得以未接到债权转让通知拒绝为由拒绝履行还款义务，丙方需对债权受让人继续履行其在本协议项下的各项义务。
          <br>
          <span class="p-span2"></span>3.1.4 如乙方违约，甲方有权要求丙方、丁方已知悉或者获得的乙方信息。
          <br>
          <span class="p-span"></span>3.2 乙方的权利与义务
          <br>
          <span class="p-span2"></span>3.2.1 乙方必须按期、足额支付应归还的本金、利息、罚息及违约金。
          <br>
          <span class="p-span2"></span>3.2.2 乙方应按照本协议约定向丙方、丁方支付相关费用。
          <br>
          <span class="p-span2"></span>3.2.3 乙方承诺并保证借款用途不用于违法犯罪用途。如有约定借款用于指定用途的，从其约定。
          <br>
          <span class="p-span2"></span>3.2.4 乙方应保证其提供资料真实、完整、准确，不得提供虚假信息或者隐瞒影响借款的重要事实等。
          <br>
          <span class="p-span2"></span>3.2.5 乙方有权了解其在丁方资信审核进度及结果。
          <br>
          <span class="p-span2"></span>3.2.6 乙方不得将本协议项下的权利义务转让给第三人。
          <br>
          <span class="p-span2"></span>3.2.7 乙方同意并认可在丁方“小鸽理财”网站（域名为：www.xiaogelicai.com）上将其持有的乙方为债务人的债权进行转让，同意甲方进行债权转让无需经过乙方的同意，且乙方在债权转让后继续向债权受让人履行本协议项下的偿还本息义务。
          <br>
          <span class="p-span"></span>3.3 丙方的权利与义务
          <br>
          <span class="p-span2"></span>3.3.1 丙方必须保证其向丁方提供的乙方信息的真实性、完整性。
          <br>
          <span class="p-span2"></span>3.3.2 丙方应负责审核乙方的借款申请、主体资格资质、资信情况、财产状况、偿还能力等与本借款相关的一切信息，并应将其发现的可能涉及乙方无法偿还借款的一切风险自发现之日起一个自然日内告知丁方，丙方还负责本协议项下借款回收与日常管理工作。
          <br>
          <span class="p-span2"></span>3.3.3 乙方在本协议项下向甲方、丁方支付的借款本金、利息、借款服务费等所有费用均由丙方代为收集后支付给丁方。
          <br>
          <span class="p-span2"></span>3.3.4 丙方有权了解乙方的信息和借款进展情况。
          <br>
          <span class="p-span"></span>3.4 丁方的权利与义务
          <br>
          <span class="p-span2"></span>3.4.1 甲方委托丁方，且丁方接受该委托代甲方出借款项应收的本息，代收后按照甲方的要求进行处置。由乙方将还款本息支付给丁方时，即视为乙方履行了本协议项下偿还本息的义务。
          <br>
          <span class="p-span2"></span>3.4.2 甲方同意在向乙方出借款项时，已委托丁方在本协议生效时将该笔借款通过第三方支付平台划付至乙方账户。
          <br>
          <span class="p-span2"></span>3.4.3 甲乙双方同意丁方有权代甲方在有必要时对乙方进行贷款的违约提醒及催收工作，包括但不限于电话通知、发送催收函、诉讼、仲裁等。甲方在此明确确认委托丁方进行以上工作，并授权丁方可将此项工作委托给第三人。乙方、丙方对上述提醒、催收事项明确知晓并应积极配合。
          <br>
          <span class="p-span2"></span>3.4.4 丁方接受甲乙双方委托产生法律效果应由委托人承担。如因甲方或者乙方或者非丁方的原因（包括但不限于技术问题）造成延误或者错误，丁方不承担任何责任。
          <br>
          <span class="p-span2"></span>3.4.5 丁方应对知悉的甲方、乙方信息进行保密；如因一方违约或者国家机关要求（包括但不限于法院、仲裁机构、金融监管机构等），丁方有权披露。
          <br>
        </p>
        <h2>四、收费及税费</h2>
        <p class="p2">
          <span class="p-span"></span>4.1 丙方有权就为本协议借款所提供的服务向乙方收取手续费和服务费、催收费等费用，上述费用的收取方式由乙、丙双方另行约定。
          <br>
          <span class="p-span"></span>4.2 丁方有权就为本协议借款所提供的服务向乙方收取综合服务费，综合费用的收取由乙、丁双方另行约定。
          <br>
        </p>
        <h2>五、 偿还方式</h2>
        <p class="p2">
          <span class="p-span"></span>5.1 乙方必须按照本协议的约定按时、足额偿还应支付借款本金和利息。
          <br>
          <span class="p-span"></span>5.2 甲方有权指定相关账户代为收取乙方的还款本金和利息，并指定该账户为本协议的还款收款账户，各方同意乙方应当支付的本息一经划转至甲方所指定的代收账户后，即视为乙方已经履行本协议项下对甲方的相应还款义务。收到上述本息后，由甲方与其资金代收方具体协商后续资金处理方式。
          <br>
          <span class="p-span"></span>5.3 如果还款日遇到法定假日或公休日，还款日期不顺延。
          <br>
          <span class="p-span"></span>5.4 如果还款日为每月30日或31日，则遇到无还款日对应日的月份，还款日为应还款当月的最后一日。
          <br>
          <span class="p-span"></span>5.5 本协议如涉及借款人系两人以上，任一借款人均应履行本协议项下的义务，对全部借款承担连带清偿责任，甲方有权向乙方任一借款人追索本金、利息、逾期罚息及其他费用。
          <br>
          <span class="p-span"></span>5.6乙方每期还款按照如下顺序清偿：
          <br>
          <span class="p-span2"></span>5.6.1各项手续费、服务费等
          <br>
          <span class="p-span2"></span>5.6.2逾期罚息
          <br>
          <span class="p-span2"></span>5.6.3拖欠利息
          <br>
          <span class="p-span2"></span>5.6.4拖欠本金
          <br>
          <span class="p-span2"></span>5.6.5当期利息
          <br>
          <span class="p-span2"></span>5.6.6当期本金
          <br>
          <span class="p-span"></span>5.7如乙方还款不足以偿还借款本金、利息和逾期罚息的，甲方同意各自按照其借出款项比例收取还款，不足的部分由丙方进行代偿。
          <br>
        </p>
        <h2>六、 债权回购及代偿</h2>
        <p class="p2">
          <span class="p-span2"></span>6.1 丙方同意为本协议下如因乙方逾期还款达到约定期限时回购甲、乙双方的债权债务，并在乙方未按时偿还债务时立刻承担逾期债权回购责任。如在约定还款日乙方未按时还款，丙方应在约定还款日次日立即向甲方所指定的收款账户转入等同于乙方当期应还的借款本息的金额。 自丙方成功支付乙方当期应还的借款本息至甲方指定的收款账户内即视为丙方债权回购已完成，此时丙方受让甲方对乙方当期的债权。
          <br>
          <span class="p-span2"></span>6.2 丙方根据上述规定承担逾期债权回购责任后，甲方在本协议项下的当期的所有权利视为已经得到满足和实现，甲方不得再对乙方提出任何请求或主张。 甲方在本协议下所享的关于当期债权的全部权利和主张，包括但不限于对借款本息等所享有权利和主张，均由丙方享有。
          <br>
          <span class="p-span2"></span>6.3 丙方的承担代偿责任的期限为：自本协议项下借款发放之日起至债务届满清偿期后2年止。
          <br>
          <span class="p-span2"></span>6.4 丙方的代偿范围包括：乙方的借款本金、、利息、逾期罚息、补偿金、综合服务费、催收费等。
          <br>
          <span class="p-span2"></span>6.5 甲方委托丁方作为其合法代理人，在本协议项下协助办理借款代偿等相关事宜，以保证甲方借款资金安全。
        </p>
        <h2>七、 提前还款</h2>
        <p class="p2">
          <span class="p-span"></span>7.1 乙方提出提前偿还全部剩余本金时，甲方授权丙方决定是否同意乙方提出的提前还款申请。丙方同意乙方提前还款申请的，应当书面通知丁方。
          <br>
          <span class="p-span"></span>7.2 还款采用先息后本方式的，乙方应向甲方一次性支付全部借款本金及当期利息。
          <br>
          <span class="p-span"></span>7.3 还款采用等额本息方式的，乙方应向甲方一次性支付剩余本金及当期利息，同时乙方应当支付提前结清补偿金，提前结清补偿金=剩余借款本金*3%。
          <br>
          <span class="p-span"></span>7.4 甲方、丙方、丁方分别收取上述提前结清补偿金的三分之一即剩余借款本金的1%，但是根据本协议中所记载的甲方借款期限不足六个月的，则甲方不能参与分配提前结清补偿金，丙方、丁方就提前结清补偿金的分配比例另行协商确定。
          <br>
          <span class="p-span"></span>7.5 提前还款的款项划转方式与约定正常还款的方式相同，全部款项划转完毕后，丁方通过短信、电话、电子邮件或者小鸽理财网站内信等方式将提前还款事宜向甲方进行提示与说明。
          <br>
          <span class="p-span"></span>7.6 如乙方未能按照本协议约定按时、足额偿还任何一期借款本息超过【90】天，或者根据丙方认定发生任何可能影响乙方偿付能力的情形，各方同意丙方有权代甲方提出提前清偿全部剩余本金的要求。
          <br>
          <span class="p-span"></span>7.7 甲方、乙方及丁方应同意该等要求，且乙方应当按上述7.1在收到丙方提前还款通知之日起三个工作日内向甲方支付剩余全部本金、当期利息及提前结清补偿金。
          <br>
          <span class="p-span"></span>7.8 如乙方未能支付上述款项则丙方需在收到丁方通知后一个工作日内履行代偿责任，自代偿之日起，甲方、丁方在本协议下所享的剩余债权的全部权利和主张，包括但不限于对借款剩余本息、逾期罚息、综合服务费等所享有权利和主张，均全部转让给丙方。
          <br>
          <span class="p-span"></span>7.9 乙方提出提前偿还部分本金的，则乙方提前还款部分由丁方监管账户代为保管，不提前抵扣乙方剩余本息及费用，在下一期还款时从中抵扣应还款项。
          <br>
        </p>
        <h2>八、逾期还款</h2>
        <p class="p2">
          <span class="p-span"></span>8.1 如约定还款日24:00前，丁方监管账户中未收到或未足额收到乙方当月应还款的，视为逾期还款。对于等额本息还款方式，乙方应按照当期应还本息，自逾期之日按【0.1%】/日的利率按日向甲方支付逾期罚息，直至清偿完毕之日止，逾期罚息不计复利。
          <br>
          <span class="p-span"></span>8.2 如乙方逾期还款且丙方未及时履行代偿责任的，对于先息后本还款方式，乙方应按照初始借款本金，自逾期之日按【0.05%】/日的利率按日向甲方支付逾期罚息，直至清偿完毕之日止，逾期罚息不计复利。
          <br>
          <span class="p-span"></span>8.3 如乙方未在每月还款日足额支付当月应还借款本息，但丙方及时履行代偿责任，从而并未造成甲方未按时收到当月应得本息还款的，则由此导致的逾期责任（包括但不限于催收费、代偿费等）由乙方及丙方另行约定。
          <br>
          <span class="p-span"></span>8.4 借款期间内，逾期罚息的计收标准可根据小鸽理财网相关规则的变化进行相应调整。如相关规则发生变化，则小鸽理财网会在网站公示该等规则的变化。
          <br>
        </p>
        <h2>九、违约责任</h2>
        <p class="p2">
          <span class="p-span"></span>9.1 如果乙方擅自改变本协议约定的借款用途、严重违反本协议义务、提供虚假资料、故意隐瞒重要事实或未经甲方、丙方同意擅自转让本协议项下借款债务的视为乙方恶意违约，甲方、丙方有权提前终止本协议；乙方须在甲方委托丙方或丁方提出终止本协议之日起3日内，按照本协议第五条规定的款项划转方式一次性支付余下的所有本金、利息，丁方再根据其与甲方之间的约定向甲方支付该等资金；如乙方未按约定时间支付上述款项的，则由丙方履行代偿义务。如乙方违约构成犯罪的，甲方、丙方及丁方有权向相关国家机关举报，依法追究其刑事责任。
          <br>
          <span class="p-span"></span>9.2 发生下列任何一项或几项情形的，视为乙方严重违约：
          <br>
          <span class="p-span2"></span>9.2.1 乙方的任何财产遭受没收、征用、查封、扣押、冻结等可能影响其履约能力的不利事件，且不能及时提供有效补救措施的；
          <br>
          <span class="p-span2"></span>9.2.2 乙方的财务状况出现影响其履约能力的不利变化，且不能及时提供有效补救措施的。
          <br>
          <span class="p-span"></span>9.3 若发生9.2款所述情形，或根据甲方、丙方合理判断乙方可能发生上述的违约事件的，甲方、丙方有权自行或由丙方委托丁方采取下列任何一项或几项救济措施：
          <br>
          <span class="p-span2"></span>9.3.1 立即暂缓、取消发放全部或部分借款；
          <br>
          <span class="p-span2"></span>9.3.2 宣布已发放借款全部提前到期，乙方应立即偿还所有应付款；
          <br>
          <span class="p-span2"></span>9.3.3 提前终止本协议；
          <br>
          <span class="p-span2"></span>9.3.4 采取法律、法规以及本协议约定的其他救济措施。
          <br>采取上述措施后，丙方在原代偿范围内继续承担本协议项下的代偿责任。
          <br>
          <span class="p-span"></span>9.4 甲方、丙方根据本协议9.1及9.3的规定自行或由丙方委托丁方终止本协议的，如乙方在其小鸽理财账户下有任何余额，则乙方余额按照本协议第5.7款进行清偿。
          <br>
          <span class="p-span"></span>9.5 甲方保留将乙方违约失信的相关信息纳入公民征信系统、向媒体和乙方单位披露的权利。因乙方未还款而带来的调查及包括但不限于诉讼费、保全费、律师费等合理、必要费用由乙方承担。
          <br>
          <span class="p-span"></span>9.6 因出现上述违约情况而提前终止本协议的，若乙方未按照约定时间向甲方一次性支付余下的所有本金、利息和相关违约金，则丙方须按本协议第七条的约定履行代偿责任，代替乙方向甲方一次性支付余下的所有本金、利息和相关违约金，丙方在履行代偿责任后，有权向乙方追偿并收取相应的款项，收取方式由乙丙双方另行约定。
          <br>
        </p>
        <h2>十、 变更通知</h2>
        <p class="p2">
          <span class="p-span"></span>10.1 本协议签订之日至借款全部清偿之日期间，若乙方向丁方提供的有关小额借款的任何信息（包括但不限于乙方姓名、身份证号码、住址、电子邮件等信息的变更）发生变更，则乙方应在发生变更之日起的三日内通过小鸽理财网提供更新后的信息给甲方，并提交相应的证明文件。
          <br>
          <span class="p-span"></span>10.2 若因乙方未及时提供上述变更信息而导致的甲方、丙方及/或丁方的调查及诉讼费用应由乙方承担。
          <br>
        </p>
        <h2>十一、 债务转让</h2>
        <p class="p2">
          <span class="p-span"></span>11.1 各方同意并确认，甲方可将本协议项下全部债权转让予第三方，但该第三方必须为小鸽理财网的注册用户。
          <br>
          <span class="p-span"></span>11.2 甲方根据本协议转让债权时，乙方不可撤销地授权丁方代为接收该等转让通知（通知方式包括但不限于更新文尾《附：债权转让记录表》）；债权受让人依法承接甲方在本协议项下的权利和义务。债权转让后，乙方需对债权受让人在剩余借款期限继续履行本协议下其对甲方的还款义务，丙方在原保证担保的范围内继续承担本协议项下的逾期债权回购责任。
          <br>
          <span class="p-span"></span>11.3 相关债权转让情况详见文末《附：债权转让记录表》，此表格仅供各方查阅之用，并应作为本协议附件。
          <br>
        </p>
        <h2>十二、 其他</h2>
        <p class="p2">
          <span class="p-span"></span>12.1 本协议以电子文本形式生成。本协议自用户同意并成功注册成为本网站用户之日起生效，除非小鸽理财终止本协议或者用户丧失网站用户资格，否则本协议持续有效。本协议终止并不免除用户根据本协议或者其他规则、约定应承担义务与责任。
          <br>
          <span class="p-span"></span>12.2 乙方将本协议下全部本金、利息、逾期罚息及其他相关费用全部偿还完毕之时，本协议即自动终止。
          <br>
          <span class="p-span"></span>12.3 小鸽理财有权对本协议的任何修改、补充，修改、补充一经作出即发生法律效力，且均须以小鸽理财网平台电子文本形式作出。
          <br>
          <span class="p-span"></span>12.4 本协议的全部事项，包括但不限于本协议的效力、解释、履行以及争议的解决均适用中华人民共和国法律；本协议项下任一条款与中国法律的强制性规定相抵触，应在该强制性规范所不禁止的最大限度范围内解释和执行，且任何该等与强制性规范相抵触的约定不应影响本协议其他条款的效力。
          <br>
          <span class="p-span"></span>12.5 如果各方在本协议履行过程中发生任何争议，应友好协商解决；如协商不成，则须提交本协议签署地人民法院进行诉讼，各方同意本协议签署地为深圳市南山区。
          <br>
          <span class="p-span"></span>12.6 各方委托小鸽理财网保管所有与本协议有关的书面文件或电子信息。
          <br>
        </p>
        <br>
        <p>附：债权转让记录</p>
        <table class="tab-box" id="agreementdebtlist">
          <tr>
            <td>债权受让人/新债权人</td>
            <td>债权转让人/原债权人</td>
            <td>转让债权价格</td>
            <td>转让时间</td>
          </tr>
          <tr v-for="(agD,index) in agDs" :key="index">
            <td v-for="valD in agD" :key="valD.id">
              <span>{{valD}}</span>
            </td>
          </tr>
        </table>
      </div>
    </div>
  </div>
</template>
<script>
export default {
  data() {
    return {
      isoldborrow: "",
      oldShow: false,
      protocolNumber: "xxxxxxxx", //协议编号
      agreementNumber: "xxxxxxxx", //协议编号
      auditTimeversion2: "xxxx年xx月xx日", //年月日
      username: "xxxx", //用户名
      realname: "xxxx", //真实姓名借款人
      realName: "xxxx", //真实姓名出借人
      guarantee: "xxxx", //丙方担保方
      guaranteeAddress: "xxxxxxxxxxx", //丙方担保方地址
      idno: "xxxxxxxxxxxxxxxxxx", //身份证号码
      legal: "xxxx", //法人姓名
      legalidCardNo: "xxxxxxxxxxxxxxxxxx", //法人身份证
      companyNo: "xxxxxxxxxxxxx", //统一社会信用代码
      enterpriseName: "xxxxxxx", //企业名称
      detail: "xxxxx", //借款用途
      borrowAmount: "xxxxx.xx", //借款本金
      annualRate: "xx.xx", //借款年利率
      paymentModeStr: "xxxx", //还款方式
      sumPI: "xxxx.xx", //每期本金利息
      lastAmount: "xxxxxxx.xx", //最后一期应还本金
      qsNumber: "xx", //还款期数
      deadline: "xx", //还款期数
      repayDay: "xx", //还款日
      month: "xx", //还款日
      lastmonthpay: "xx", //还款日
      lastMonthpay: "xx", //还款日
      auditTime1: "xxxx-xx-xx", //借款期限开始
      endtimwe1: "xxxx-xx-xx", //借款期限结束
      penaltyInterest: "x.x", //罚息利率
      sb1: "xxxx-xx-xx", //借款期限开始
      sb2: "xxxx-xx-xx", //借款期限结束
      borrowImage: "", //借款人签章图片
      guaranteeImage: "", //担保方签章图片
      borrowWay: "", //借款方
      curYear: "xxxx", //年
      curMonth: "xx", //月
      curDay: "xx", //日
      jias: [],
      agDs: [],
      fetchToken: ""
    };
  },
  methods: {
    discern: function() {
      this.isoldborrow = this.$route.query.isoldborrow;
      if (this.isoldborrow == "0") {
        this.postData();
      } else if (this.isoldborrow == "1") {
        this.oldData();
      }
    },
    getAppToken: function() {
      let thatData = this;
      if (thatData.$route.query.id) {
        thatData
          .$withApp("postApp", {
            status: 0,
            result: {
              transferName: "getTokenFromApp",
              transferData: {}
            },
            msg: "success"
          })
          .then(data => {
            if (data == "wap") {
              thatData.discern();
            } else {
              data = JSON.parse(data);
              let dataRes = data.result;
              base.data.token = dataRes.transferData.token;
              localStorage.setItem("token", dataRes.transferData.token);
              thatData.discern();
              return thatData.$withApp("takeAppTable", {
                status: 0,
                result: {
                  transferName: "showDownLoadButton",
                  transferData: {
                    projectid: thatData.$route.query.investId,
                    protocolType: "2"
                  }
                },
                msg: "success"
              });
            }
          });
      }
    },
    postData: function() {
      var thatData = this;

      var data = {
        investType: thatData.$route.query.type,
        investId: thatData.$route.query.investId,
        borrowId: thatData.$route.query.id,
        isDebtOut: "0"
      };

      this.$http
        .post("/api/assets/investBorrowProtocol", this.$qs.stringify(data), {
          headers: base.ajaxHeadersWithToken(data)
        })
        .then(function(response) {
          //console.log(response)
          let resData = response.data;

          if (resData.msg == "操作成功!") {
            thatData.protocolNumber = resData.result.protocolNumber;
            thatData.auditTimeversion2 =
              resData.result.headMap.auditTimeversion2;
            thatData.username = resData.result.yi.username;
            thatData.realname = resData.result.yi.realname;
            thatData.realName = resData.result.investUser.realName;
            thatData.guarantee = resData.result.headMap.guarantee;
            thatData.borrowWay = resData.result.headMap.borrowWay;
            thatData.guaranteeAddress = resData.result.headMap.guaranteeAddress;
            thatData.idno = resData.result.yi.idno;
            thatData.companyNo = resData.result.headMap.companyNo;
            thatData.legal = resData.result.headMap.legal;
            thatData.legalidCardNo = resData.result.headMap.legalidCardNo;
            thatData.enterpriseName = resData.result.headMap.enterpriseName;
            thatData.detail = resData.result.headMap.detail;
            thatData.borrowAmount = resData.result.headMap.borrowAmount;
            thatData.annualRate = resData.result.headMap.annualRate;
            thatData.paymentModeStr = resData.result.headMap.paymentModeStr;
            thatData.sumPI = resData.result.headMap.sumPI;
            thatData.lastAmount = resData.result.headMap.lastAmount;
            thatData.qsNumber = resData.result.headMap.qsNumber;
            thatData.repayDay = resData.result.headMap.repayDay;
            thatData.auditTime1 = resData.result.headMap.auditTime1;
            thatData.endtimwe1 = resData.result.headMap.endtimwe1;
            thatData.penaltyInterest = resData.result.penaltyInterest;
            thatData.curYear = resData.result.curYear;
            thatData.curMonth = resData.result.curMonth;
            thatData.curDay = resData.result.curDay;
            thatData.borrowImage =
              "data:image/png;base64," + resData.result.borrowImage;
            thatData.guaranteeImage =
              "data:image/png;base64," + resData.result.guaranteeImage;

            for (var i = 0; i < resData.result.jias.length; i++) {
              var arr = [];
              if (resData.result.jias[i].flag == "1") {
                arr.push(
                  resData.result.jias[i].username,
                  resData.result.jias[i].realname,
                  resData.result.jias[i].investamount,
                  resData.result.jias[i].allPay
                );
                thatData.jias.push(arr);
              } else {
              }
            }
          } else {
            mui.alert(resData.msg);
          }
        })
        .catch(function(error) {
          console.log(error);
        });
    },
    oldData: function() {
      var thatData = this;

      var data = {
        investType: thatData.$route.query.type,
        investId: thatData.$route.query.investId,
        borrowId: thatData.$route.query.id,
        isDebtOut: "0"
      };

      this.$http
        .post("/api/assets/investBorrowProtocol", this.$qs.stringify(data), {
          headers: base.ajaxHeadersWithToken(data)
        })
        .then(function(response) {
          //console.log(response)
          let resultJson = response.data.result;

          if (response.data.msg == "操作成功!") {
            thatData.agreementNumber = resultJson.headMap.agreementNumber;
            thatData.detail = resultJson.headMap.detail;

            thatData.username = resultJson.yi.username;
            thatData.realname = resultJson.yi.realname;
            thatData.idno = resultJson.yi.idno;
            thatData.auditTimeversion2 = resultJson.headMap.auditTimeversion2;
            thatData.detail = resultJson.headMap.detail;
            thatData.annualRate = resultJson.headMap.annualRate;
            thatData.lastMonthpay = resultJson.lastMonthpay;
            thatData.month = resultJson.month;
            thatData.deadline = resultJson.headMap.deadline;
            thatData.sb1 = resultJson.sb1;
            thatData.sb2 = resultJson.sb2;
            thatData.borrowAmount = resultJson.headMap.borrowAmount;
            thatData.agreementNumber = resultJson.headMap.agreementNumber;

            for (var i = 0; i < resultJson.jias.length; i++) {
              var arr = [];
              arr.push(
                resultJson.jias[i].username,
                resultJson.jias[i].realname,
                resultJson.jias[i].investamount,
                resultJson.jias[i].allPay
              );
              thatData.jias.push(arr);
            }

            for (var i = 0; i < resultJson.agreementDebtList.length; i++) {
              var arrR = [];
              arr.push(
                resultJson.agreementDebtList[i].alienatorid,
                resultJson.agreementDebtList[i].auctionerid,
                resultJson.agreementDebtList[i].auctionhighprice,
                resultJson.agreementDebtList[i].auctionendtime
              );
              thatData.agD.push(arrR);
            }
          } else {
            mui.alert(response.data.msg);
          }
        })
        .catch(function(error) {
          console.log(error);
        });
    }
  },
  mounted: function() {
    this.getAppToken();
    //base.inLocalStorage()
  }
};
</script>
<style>
@import "../../../style/css/mobile_agreement.css";
</style>
